{"textBlocks":[{"content":"What is next?","mainContent":"There is a left over dummy text in the distribution. It isnt major, but I would address it if you want to be more \"professional.\" You could look at it like an example that a user could modify on their own and leave it there as it may encourage interaction. I haven't quite decided yet b","font":"default","size":"17"},{"content":"What to do with old left data.","mainContent":"I think I might keep it there for now. I don't have too much of a problem with it and since you have already provided the source code, they can build out a fresh one for themselves anyways. Just keep continuing to make updates and patches and update the webpage with your distribution downloads just to stay sharp and know that you are the only one using this tool in the way that you have created it. So you don't have to be too concerned.","font":"traditional","size":"37"},{"content":"Noted Issues","mainContent":"I did find a bug and also a solution to it. \n\nIt seems that over time, the text disappears or maybe it is in the middle of an update and so the previous text is removed. I dont know why but it seems to heal or fix itself when I press the reset button. Some folks wouldn't probably even know this, but for me, it kind of can be looked at like a bug. ","font":"traditional","size":"37"},{"content":"Possible Solutions.","mainContent":"I think I figured out a workaround or a solution to what is happening. You have to press Send to Type Writer and not the Save button. Only use the save button if you wish to stay on the list screen itself. Otherwise, you have to press send to type writer. There is something happening in the save button that I have to investigate which may be resetting or causing the page to turn blank. Thank goodness for that reset button though because it is working properly in many different situations that I didn't really forsee. So at the end of this sentence, instead of save, you press: Send to Type Writer, because the block already saves itself on the list as well.","font":"default","size":"17"},{"content":"Edits...","mainContent":"It looks like that is not the reason for the previous bug. However, it I have found that the reset button is the solution to this.","font":"default","size":"17"},{"content":"test","mainContent":"testsdfsdf","font":"traditional","size":"37"},{"content":"Found issue.","mainContent":"There is a bug where when you click either save or send to type writer that it creates a new workspace which is not the proper behavior. I must investigate further because it didnt do something like this before.","font":"traditional","size":"37"},{"content":"What Ive Found and Figured Out","mainContent":"I realized that you have to add these items onto the list first. Instead of getting excited and pressing the button.\n\nInstead, you have to add the item into the text block and then go back to the type writer workspace. From there, you must prepare the spot you are going to insert it the text in. Then, press the button. \n\nOtherwise, you will have a new page with this text block each time that you press the button. ","font":"traditional","size":"37"},{"content":"Solution.","mainContent":"I found out that the above was the solution.","font":"traditional","size":"37"},{"content":"Order to creating elements and objects.","mainContent":"Now I think I could get the hang of this particular style or working or building text pieces up. This is particularly great for very large pieces of content that you want to organize well without having to type it out and not understand.\n<br>\nThe other problem I noticed was that it may not listen to your spaces when you type. I wonder if it can listen to my HTML code here?\n<br>\nI dont think it will, because I have it only listening to the breaker or something. I will have to see about that..","font":"traditional","size":"37"},{"content":"Timing and Spacing","mainContent":"It looks like this doesn't listen to your new lines. You have to keep everything in one block. Im not sure if I like this or if I care because the person can also go in and make their own edits to it later. However, it would be nice if you got the exact spacing and everything perfectly down pat. \n\nThat way, I could do something like this by itself.","font":"traditional","size":"37"},{"content":"New Document","mainContent":"This is a new document from the list content at the end.","font":"traditional","size":"37"},{"content":"New Block","mainContent":"Add more content","font":"traditional","size":"37"},{"content":"Another block.","mainContent":"Add block here.","font":"traditional","size":"37"},{"content":"New block","mainContent":"random content","font":"traditional","size":"37"},{"content":"Fixing the issues at hand","mainContent":"I think all you have to do is make sure the workspace is stored on the right one.","font":"traditional","size":"37"},{"content":"Another solution","mainContent":"Go back to the type writer and prepare the cursor. After you have saved the content title and main block.\n\nThen, add the text from the list ","font":"traditional","size":"37"},{"content":"Best case scenarios","mainContent":"You have to understand that you must first prepare your text area and your workspace on the type writer first before sending the text block over to the correct placement and to be appended on the document.","font":"default","size":"17"},{"content":"Successful Transition","mainContent":"It looks like those steps are the way to make certain this gets organized as you see fit. All you have to do is save and maintain your workspace and then click back onto the type writer program so that it knows that you have it in memory to append the text. Otherwise, if you do it outright from the List program, it will create a new block.","font":"default","size":"17"},{"content":"Works!","mainContent":"This works! Im now showing how this appeared as a bug before. But now it works.","font":"traditional","size":"37"}]}